[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:1:24
-function sumAll(array) {
-  validateArray(array);
-  const sortedArray = sortArrayAsc(array);
-  const consecutiveNumbers = generateSequentialArray(sortedArray[0], sortedArray[1]);
-  const sumOfNumbersFromArray = addNumbersFromArray(consecutiveNumbers);
- return sumOfNumbersFromArray;
-}
+function sumAll(array) {}
 
 function sortArrayAsc(array) {
killedBy: Sum All Numbers in a Range sumAll() should throw an error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "You must provide an array."

Received function did not throw

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:9:30
  return sumOfNumbersFromArray;
 }
 
-function sortArrayAsc(array) {
-  return array.sort((a, b) => a - b);
-}
+function sortArrayAsc(array) {}
 
 function generateSequentialArray(start,end) {
killedBy: Sum All Numbers in a Range sumAll([1, 2]) should return a number.
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] ArrowFunction
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:10:21
 }
 
 function sortArrayAsc(array) {
-  return array.sort((a, b) => a - b);
+  return array.sort(() => undefined);
 }
 
killedBy: Sum All Numbers in a Range sumAll([2,1]) should return 3
statusReason: TypeError: Reduce of empty array with no initial value

[Killed] ArithmeticOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:10:31
 }
 
 function sortArrayAsc(array) {
-  return array.sort((a, b) => a - b);
+  return array.sort((a, b) => a + b);
 }
 
killedBy: Sum All Numbers in a Range sumAll([2,1]) should return 3
statusReason: TypeError: Reduce of empty array with no initial value

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:13:45
   return array.sort((a, b) => a - b);
 }
 
-function generateSequentialArray(start,end) {
-  return [...Array(end - start + 1).keys()].map((index) => index + start);
-}
+function generateSequentialArray(start,end) {}
 
 function validateArray(array) {
killedBy: Sum All Numbers in a Range sumAll([1, 2]) should return a number.
statusReason: TypeError: Cannot read property 'reduce' of undefined

[Killed] ArithmeticOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:14:20
 }
 
 function generateSequentialArray(start,end) {
-  return [...Array(end - start + 1).keys()].map((index) => index + start);
+  return [...Array(end + start + 1).keys()].map((index) => index + start);
 }
 
killedBy: Sum All Numbers in a Range sumAll([1, 2]) should return 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 10

[Killed] ArithmeticOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:14:20
 }
 
 function generateSequentialArray(start,end) {
-  return [...Array(end - start + 1).keys()].map((index) => index + start);
+  return [...Array(end - start - 1).keys()].map((index) => index + start);
 }
 
killedBy: Sum All Numbers in a Range sumAll([1, 2]) should return 3
statusReason: TypeError: Reduce of empty array with no initial value

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:17:31
   return [...Array(end - start + 1).keys()].map((index) => index + start);
 }
 
-function validateArray(array) {
-   if (!Array.isArray(array)) {
-    throw new Error("You must provide an array.");
-  }
-   if (array.length !== 2) {
-     throw new Error("You must provide an array with 2 items.");
-   }
-}
+function validateArray(array) {}
 function addNumbersFromArray(array) {
   return array.reduce(
killedBy: Sum All Numbers in a Range sumAll() should throw an error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "You must provide an array."
Received message:   "Cannot read property 'sort' of undefined"

      71 |   } else {
      72 |     stryCov_9fa48("1");
    > 73 |     return array.sort(stryMutAct_9fa48("2") ? () => undefined : (stryCov_9fa48("2"), (a, b) => stryMutAct_9fa48("3") ? a + b : (stryCov_9fa48("3"), a - b)));

[Killed] BooleanLiteral
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:18:8
 }
 
 function validateArray(array) {
-   if (!Array.isArray(array)) {
+   if (Array.isArray(array)) {
     throw new Error("You must provide an array.");
   }
killedBy: Sum All Numbers in a Range sumAll() should throw an error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "You must provide an array."
Received message:   "Cannot read property 'length' of undefined"

       99 |     }
      100 |
    > 101 |     if (stryMutAct_9fa48("19") ? array.length === 2 : stryMutAct_9fa48("18") ? false : stryMutAct_9fa48("17") ? true : (stryCov_9fa48("17", "18", "19"), array.length !== 2)) {

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:18:31
 }
 
 function validateArray(array) {
-   if (!Array.isArray(array)) {
-    throw new Error("You must provide an array.");
-  }
+   if (!Array.isArray(array)) {}
    if (array.length !== 2) {
      throw new Error("You must provide an array with 2 items.");
killedBy: Sum All Numbers in a Range sumAll() should throw an error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "You must provide an array."
Received message:   "Cannot read property 'length' of undefined"

       99 |     }
      100 |
    > 101 |     if (stryMutAct_9fa48("19") ? array.length === 2 : stryMutAct_9fa48("18") ? false : stryMutAct_9fa48("17") ? true : (stryCov_9fa48("17", "18", "19"), array.length !== 2)) {

[Killed] StringLiteral
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:19:21
 
 function validateArray(array) {
    if (!Array.isArray(array)) {
-    throw new Error("You must provide an array.");
+    throw new Error("");
   }
    if (array.length !== 2) {
killedBy: Sum All Numbers in a Range sumAll() should throw an error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "You must provide an array."
Received message:   ""

       95 |       } else {
       96 |         stryCov_9fa48("15");
    >  97 |         throw new Error(stryMutAct_9fa48("16") ? "" : (stryCov_9fa48("16"), "You must provide an array."));

[Killed] EqualityOperator
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:21:8
    if (!Array.isArray(array)) {
     throw new Error("You must provide an array.");
   }
-   if (array.length !== 2) {
+   if (array.length === 2) {
      throw new Error("You must provide an array with 2 items.");
    }
killedBy: Sum All Numbers in a Range sumAll([]) should throw an error
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "You must provide an array with 2 items."
Received message:   "Invalid array length"

      80 |   } else {
      81 |     stryCov_9fa48("4");

[Killed] ConditionalExpression
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:21:8
    if (!Array.isArray(array)) {
     throw new Error("You must provide an array.");
   }
-   if (array.length !== 2) {
+   if (true) {
      throw new Error("You must provide an array with 2 items.");
    }
killedBy: Sum All Numbers in a Range sumAll([1, 2]) should return a number.
statusReason: Error: You must provide an array with 2 items.

[Killed] BlockStatement
JavaScript Algorithms and Data Structures/Intermediate Algorithm Scripting/sum-all-numbers-in-a-range/sumAllNumbersInARange.js:25:37
      throw new Error("You must provide an array with 2 items.");
    }
 }
-function addNumbersFromArray(array) {
-  return array.reduce(
-    (accumulator, currentValue) => accumulator + currentValue
-  );
-}
+function addNumbersFromArray(array) {}
 
 module.exports = { sumAll };
killedBy: Sum All Numbers in a Range sumAll([1, 2]) should return a number.
statusReason: Error: expect(received).toBeNumber()

Expected value to be a number received:
  undefined
